Ran Plan for dir: `infra` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_service.atlantis will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "atlantis" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "atlantis"
          + namespace        = "atlantis"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # helm_release.atlantis will be updated in-place
~ resource "helm_release" "atlantis" {
        id                         = "atlantis"
      ~ metadata                   = [
          - {
              - app_version    = "v0.34.0"
              - chart          = "atlantis"
              - first_deployed = 1748214938
              - last_deployed  = 1748214938
              - name           = "atlantis"
              - namespace      = "atlantis"
              - notes          = <<-EOT
                    1. Get the application URL by running these commands:
                         NOTE: It may take a few minutes for the LoadBalancer IP to be available.
                               You can watch the status of by running 'kubectl get svc -w atlantis'
                      export SERVICE_IP=$(kubectl get svc --namespace atlantis atlantis -o jsonpath='{.status.loadBalancer.ingress[0].ip}')
                      echo http://$SERVICE_IP:80
                    2. Atlantis will not start successfully unless at least one of the following sets of credentials are specified (see values.yaml for detailed usage):
                      - github
                      - githubApp
                      - gitea
                      - gitlab
                      - bitbucket
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - github         = {
                          - secret = "(sensitive value)"
                          - token  = "(sensitive value)"
                          - user   = "ed-bogd"
                        }
                      - ingress        = {
                          - enabled = false
                        }
                      - orgAllowlist   = "github.com/ed-bogd/*"
                      - service        = {
                          - annotations = {
                              - "service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled" = "true"
                              - "service.beta.kubernetes.io/aws-load-balancer-scheme"                            = "internet-facing"
                              - "service.beta.kubernetes.io/aws-load-balancer-type"                              = "classic"
                            }
                          - port        = 80
                          - type        = "LoadBalancer"
                        }
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
                            }
                          - create      = true
                          - name        = "atlantis"
                        }
                      - volumeClaim    = {
                          - accessModes      = [
                              - "ReadWriteOnce",
                            ]
                          - dataStorage      = "5Gi"
                          - enabled          = true
                          - storageClassName = "gp2"
                        }
                    }
                )
              - version        = "5.17.2"
            },
        ] -> (known after apply)
        name                       = "atlantis"
      ~ values                     = [
          ~ <<-EOT
              - github:
              -   user: "ed-bogd"
              - 
              - orgAllowlist: github.com/ed-bogd/*
              - 
              - serviceAccount:
              -   create: true
              -   name: atlantis
              -   annotations:
              -     eks.amazonaws.com/role-arn: "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
              - 
              - service:
              -   type: LoadBalancer
              -   port: 80
              -   annotations:
              -     service.beta.kubernetes.io/aws-load-balancer-scheme: "internet-facing"
              -     service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled: "true"
              -     service.beta.kubernetes.io/aws-load-balancer-type: "classic"
              - 
              - ingress:
              -   enabled: false
              - 
              - volumeClaim:
              -   enabled: true
              -   dataStorage: 5Gi
              -   storageClassName: gp2
              + github:
              +   user: "ed-bogd"
              +   token: ""
              +   secret: ""
              + 
              + orgAllowlist: github.com/ed-bogd/*
              + 
              + serviceAccount:
              +   create: true
              +   name: atlantis
              +   annotations:
              +     eks.amazonaws.com/role-arn: "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
              + 
              + service:
              +   type: LoadBalancer
              +   port: 80
              +   annotations:
              +     service.beta.kubernetes.io/aws-load-balancer-scheme: "internet-facing"
              +     service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled: "true"
              +     service.beta.kubernetes.io/aws-load-balancer-type: "classic"
              + 
              + ingress:
              +   enabled: false
              + 
              + volumeClaim:
              +   enabled: true
              +   dataStorage: 5Gi
              +   storageClassName: gp2
                  accessModes: ["ReadWriteOnce"]
            EOT,
        ]
        # (26 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
~ atlantis_url                = "ae853c39d064b43fe91b948c48f307ed-1828799632.eu-central-1.elb.amazonaws.com" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=ed-bogd%252Fdevops-task%252Finfra%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```